000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TMPL02.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01    SALES-TOTAL             PIC S9(5)V99  VALUE 44707.66.
000900 01    COMMISSION-PERCENT      PIC 99        VALUE 11.
001000 01    PERCENT-AS-DECIMAL      PIC V99.
001100 01    THE-COMMISSION          PIC S9(5)V99  VALUE ZERO.
001200
001300 01    DISPLAY-COMMISSION      PIC ZZZZ9.99-.
       01    ACCEPT-VALUE            PIC ZZ,ZZ9.99-.
...... PROCEDURE DIVISION.
002500* Divide commission by 100 to convert to decimal
002600     COMPUTE PERCENT-AS-DECIMAL =
002700       COMMISSION-PERCENT / 100.
002800
002900     COMPUTE THE-COMMISSION =
003000       PERCENT-AS-DECIMAL * SALES-TOTAL * -1.
003100
003200     MOVE THE-COMMISSION TO DISPLAY-COMMISSION.
003300
003400     DISPLAY "The Commission is "
003500       DISPLAY-COMMISSION.
           DISPLAY ":" THE-COMMISSION.
       ACCEPT ACCEPT-VALUE.
       DISPLAY ACCEPT-VALUE.
       MOVE ACCEPT-VALUE TO SALES-TOTAL.
       DISPLAY SALES-TOTAL.
     
