000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ZEROPAR.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 PROCEDURE DIVISION.
000800 PROGRAM-BEGIN.
000810 STEP-01.
000820     DISPLAY "hlkjhkjhl".
000830 PERFORM PAR-1.
000831 PERFORM PAR-2.
000900
001000 PROGRAM-DONE.
001100     STOP RUN.
001200 PAR-1.
001300     DISPLAY "PAR1".
001301     PERFORM PAR-1.
001400 PAR-2.
001500     DISPLAY "PAR2".
001501     PERFORM PAR-1.
