       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION. 
        

       01 TESTREC.
            88 CONDVAL VALUE HIGH-VALUES.
            05 FIELD1       PIC 9(5).
            05 FIELD2       PIC X(5) VALUE ALL "-".

       PROCEDURE DIVISION.

       DISPLAY TESTREC.
       SET CONDVAL TO TRUE.
       DISPLAY TESTREC.
       
       STOP RUN.
       END PROGRAM TEST88.

